perf/results/single-node/1-breakpoint/ping/run2.log

> perf@1.0.0 artillery
> NODE_OPTIONS=--max-old-space-size=4096 artillery "run" "./results/single-node/1-breakpoint/cfg-breakpoint.yaml" "-e" "nodeping"

Phase started: Ramp (index: 0, duration: 300s) 17:02:43(-0300)

--------------------------------------
Metrics for period to: 17:02:50(-0300) (width: 6.486s)
--------------------------------------

http.codes.200: ................................................................ 332
http.request_rate: ............................................................. 53/sec
http.requests: ................................................................. 332
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 11
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 7.9
http.responses: ................................................................ 332
vusers.completed: .............................................................. 332
vusers.created: ................................................................ 332
vusers.created_by_name.Root (/): ............................................... 332
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.1
  max: ......................................................................... 107.8
  median: ...................................................................... 7.6
  p95: ......................................................................... 18.4
  p99: ......................................................................... 42.5


--------------------------------------
Metrics for period to: 17:03:00(-0300) (width: 9.993s)
--------------------------------------

http.codes.200: ................................................................ 1428
http.request_rate: ............................................................. 144/sec
http.requests: ................................................................. 1429
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 38
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 10.1
http.responses: ................................................................ 1428
vusers.completed: .............................................................. 1428
vusers.created: ................................................................ 1430
vusers.created_by_name.Root (/): ............................................... 1430
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.9
  max: ......................................................................... 44.9
  median: ...................................................................... 5.9
  p95: ......................................................................... 13.1
  p99: ......................................................................... 18


--------------------------------------
Metrics for period to: 17:03:10(-0300) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 2596
http.request_rate: ............................................................. 262/sec
http.requests: ................................................................. 2597
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 24
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 7.9
http.responses: ................................................................ 2596
vusers.completed: .............................................................. 2596
vusers.created: ................................................................ 2597
vusers.created_by_name.Root (/): ............................................... 2597
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.5
  max: ......................................................................... 49.6
  median: ...................................................................... 4.7
  p95: ......................................................................... 11.8
  p99: ......................................................................... 16.9


--------------------------------------
Metrics for period to: 17:03:20(-0300) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 3418
http.request_rate: ............................................................. 343/sec
http.requests: ................................................................. 3416
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 47
  median: ...................................................................... 2
  p95: ......................................................................... 7.9
  p99: ......................................................................... 16
http.responses: ................................................................ 3418
vusers.completed: .............................................................. 3418
vusers.created: ................................................................ 3415
vusers.created_by_name.Root (/): ............................................... 3415
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.5
  max: ......................................................................... 57.8
  median: ...................................................................... 4.6
  p95: ......................................................................... 17.6
  p99: ......................................................................... 30.9


--------------------------------------
Metrics for period to: 17:03:30(-0300) (width: 9.999s)
--------------------------------------

http.codes.200: ................................................................ 4618
http.request_rate: ............................................................. 463/sec
http.requests: ................................................................. 4618
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 17
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 10.1
http.responses: ................................................................ 4618
vusers.completed: .............................................................. 4617
vusers.created: ................................................................ 4618
vusers.created_by_name.Root (/): ............................................... 4618
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.2
  max: ......................................................................... 42.1
  median: ...................................................................... 3.5
  p95: ......................................................................... 11.6
  p99: ......................................................................... 17.6


--------------------------------------
Metrics for period to: 17:03:40(-0300) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 4372
http.request_rate: ............................................................. 447/sec
http.requests: ................................................................. 4442
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 639
  median: ...................................................................... 19.9
  p95: ......................................................................... 273.2
  p99: ......................................................................... 415.8
http.responses: ................................................................ 4372
vusers.completed: .............................................................. 4373
vusers.created: ................................................................ 4444
vusers.created_by_name.Root (/): ............................................... 4444
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.3
  max: ......................................................................... 642.7
  median: ...................................................................... 23.8
  p95: ......................................................................... 278.7
  p99: ......................................................................... 415.8


--------------------------------------
Metrics for period to: 17:03:50(-0300) (width: 9.999s)
--------------------------------------

http.codes.200: ................................................................ 3769
http.request_rate: ............................................................. 392/sec
http.requests: ................................................................. 3922
http.response_time:
  min: ......................................................................... 13
  max: ......................................................................... 880
  median: ...................................................................... 228.2
  p95: ......................................................................... 584.2
  p99: ......................................................................... 727.9
http.responses: ................................................................ 3769
vusers.completed: .............................................................. 3769
vusers.created: ................................................................ 3921
vusers.created_by_name.Root (/): ............................................... 3921
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 14.3
  max: ......................................................................... 884
  median: ...................................................................... 232.8
  p95: ......................................................................... 584.2
  p99: ......................................................................... 727.9


--------------------------------------
Metrics for period to: 17:04:00(-0300) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 4532
http.request_rate: ............................................................. 445/sec
http.requests: ................................................................. 4442
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1374
  median: ...................................................................... 340.4
  p95: ......................................................................... 837.3
  p99: ......................................................................... 1130.2
http.responses: ................................................................ 4532
vusers.completed: .............................................................. 4532
vusers.created: ................................................................ 4443
vusers.created_by_name.Root (/): ............................................... 4443
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.5
  max: ......................................................................... 1376.4
  median: ...................................................................... 347.3
  p95: ......................................................................... 837.3
  p99: ......................................................................... 1130.2


--------------------------------------
Metrics for period to: 17:04:10(-0300) (width: 9.999s)
--------------------------------------

http.codes.200: ................................................................ 5652
http.request_rate: ............................................................. 564/sec
http.requests: ................................................................. 5623
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1353
  median: ...................................................................... 190.6
  p95: ......................................................................... 772.9
  p99: ......................................................................... 1002.4
http.responses: ................................................................ 5652
vusers.completed: .............................................................. 5652
vusers.created: ................................................................ 5622
vusers.created_by_name.Root (/): ............................................... 5622
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.4
  max: ......................................................................... 1355.5
  median: ...................................................................... 194.4
  p95: ......................................................................... 772.9
  p99: ......................................................................... 1002.4


--------------------------------------
Metrics for period to: 17:04:20(-0300) (width: 9.999s)
--------------------------------------

http.codes.200: ................................................................ 6226
http.request_rate: ............................................................. 615/sec
http.requests: ................................................................. 6139
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 974
  median: ...................................................................... 108.9
  p95: ......................................................................... 645.6
  p99: ......................................................................... 804.5
http.responses: ................................................................ 6226
vusers.completed: .............................................................. 6226
vusers.created: ................................................................ 6139
vusers.created_by_name.Root (/): ............................................... 6139
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.1
  max: ......................................................................... 975.5
  median: ...................................................................... 111.1
  p95: ......................................................................... 645.6
  p99: ......................................................................... 820.7


--------------------------------------
Metrics for period to: 17:04:30(-0300) (width: 9.998s)
--------------------------------------

errors.ECONNRESET: ............................................................. 23
http.codes.200: ................................................................ 6681
http.request_rate: ............................................................. 669/sec
http.requests: ................................................................. 6689
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1051
  median: ...................................................................... 47.9
  p95: ......................................................................... 550.1
  p99: ......................................................................... 742.6
http.responses: ................................................................ 6681
vusers.completed: .............................................................. 6681
vusers.created: ................................................................ 6688
vusers.created_by_name.Root (/): ............................................... 6688
vusers.failed: ................................................................. 23
vusers.session_length:
  min: ......................................................................... 1.4
  max: ......................................................................... 1057.5
  median: ...................................................................... 51.9
  p95: ......................................................................... 550.1
  p99: ......................................................................... 742.6


--------------------------------------
Metrics for period to: 17:04:40(-0300) (width: 9.999s)
--------------------------------------

errors.ECONNRESET: ............................................................. 40
http.codes.200: ................................................................ 6008
http.request_rate: ............................................................. 612/sec
http.requests: ................................................................. 6124
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1682
  median: ...................................................................... 127.8
  p95: ......................................................................... 788.5
  p99: ......................................................................... 1200.1
http.responses: ................................................................ 6008
vusers.completed: .............................................................. 6008
vusers.created: ................................................................ 6126
vusers.created_by_name.Root (/): ............................................... 6126
vusers.failed: ................................................................. 40
vusers.session_length:
  min: ......................................................................... 1.6
  max: ......................................................................... 1683.2
  median: ...................................................................... 133
  p95: ......................................................................... 788.5
  p99: ......................................................................... 1200.1


--------------------------------------
Metrics for period to: 17:04:50(-0300) (width: 9.999s)
--------------------------------------

http.codes.200: ................................................................ 3000
http.request_rate: ............................................................. 584/sec
http.requests: ................................................................. 5824
http.response_time:
  min: ......................................................................... 82
  max: ......................................................................... 6434
  median: ...................................................................... 2276.1
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 4867
http.responses: ................................................................ 3000
vusers.completed: .............................................................. 3000
vusers.created: ................................................................ 5823
vusers.created_by_name.Root (/): ............................................... 5823
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 84.1
  max: ......................................................................... 6447.3
  median: ...................................................................... 2276.1
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 4867


--------------------------------------
Metrics for period to: 17:05:00(-0300) (width: 9.999s)
--------------------------------------

http.codes.200: ................................................................ 4329
http.request_rate: ............................................................. 646/sec
http.requests: ................................................................. 6438
http.response_time:
  min: ......................................................................... 3341
  max: ......................................................................... 8942
  median: ...................................................................... 5598.4
  p95: ......................................................................... 7557.1
  p99: ......................................................................... 8186.6
http.responses: ................................................................ 4329
vusers.completed: .............................................................. 4329
vusers.created: ................................................................ 6438
vusers.created_by_name.Root (/): ............................................... 6438
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3344.1
  max: ......................................................................... 8951.9
  median: ...................................................................... 5598.4
  p95: ......................................................................... 7557.1
  p99: ......................................................................... 8186.6


--------------------------------------
Metrics for period to: 17:05:10(-0300) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 981
http.codes.200: ................................................................ 4029
http.request_rate: ............................................................. 546/sec
http.requests: ................................................................. 5459
http.response_time:
  min: ......................................................................... 6038
  max: ......................................................................... 10023
  median: ...................................................................... 8352
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 4029
vusers.completed: .............................................................. 4029
vusers.created: ................................................................ 5460
vusers.created_by_name.Root (/): ............................................... 5460
vusers.failed: ................................................................. 981
vusers.session_length:
  min: ......................................................................... 6039.3
  max: ......................................................................... 10028.5
  median: ...................................................................... 8352
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 17:05:20(-0300) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 5012
http.codes.200: ................................................................ 584
http.request_rate: ............................................................. 595/sec
http.requests: ................................................................. 5939
http.response_time:
  min: ......................................................................... 7192
  max: ......................................................................... 9997
  median: ...................................................................... 9047.6
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 584
vusers.completed: .............................................................. 584
vusers.created: ................................................................ 5939
vusers.created_by_name.Root (/): ............................................... 5939
vusers.failed: ................................................................. 5012
vusers.session_length:
  min: ......................................................................... 7197.8
  max: ......................................................................... 10001
  median: ...................................................................... 9230.4
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 17:05:30(-0300) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 3190
http.codes.200: ................................................................ 2612
http.request_rate: ............................................................. 700/sec
http.requests: ................................................................. 6997
http.response_time:
  min: ......................................................................... 6420
  max: ......................................................................... 10002
  median: ...................................................................... 8868.4
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 2612
vusers.completed: .............................................................. 2612
vusers.created: ................................................................ 6996
vusers.created_by_name.Root (/): ............................................... 6996
vusers.failed: ................................................................. 3190
vusers.session_length:
  min: ......................................................................... 6448
  max: ......................................................................... 10008
  median: ...................................................................... 9230.4
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 17:05:40(-0300) (width: 9.999s)
--------------------------------------

errors.ECONNRESET: ............................................................. 5
errors.ETIMEDOUT: .............................................................. 5937
http.codes.200: ................................................................ 1056
http.request_rate: ............................................................. 630/sec
http.requests: ................................................................. 6285
http.response_time:
  min: ......................................................................... 8187
  max: ......................................................................... 10001
  median: ...................................................................... 9230.4
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 1056
vusers.completed: .............................................................. 1056
vusers.created: ................................................................ 6286
vusers.created_by_name.Root (/): ............................................... 6286
vusers.failed: ................................................................. 5942
vusers.session_length:
  min: ......................................................................... 8220.2
  max: ......................................................................... 10008.5
  median: ...................................................................... 9416.8
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 17:05:50(-0300) (width: 9.999s)
--------------------------------------

errors.ECONNRESET: ............................................................. 3
errors.ETIMEDOUT: .............................................................. 6260
http.codes.200: ................................................................ 19
http.request_rate: ............................................................. 562/sec
http.requests: ................................................................. 5600
http.response_time:
  min: ......................................................................... 9600
  max: ......................................................................... 9972
  median: ...................................................................... 9801.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 19
vusers.completed: .............................................................. 19
vusers.created: ................................................................ 5603
vusers.created_by_name.Root (/): ............................................... 5603
vusers.failed: ................................................................. 6263
vusers.session_length:
  min: ......................................................................... 9602.5
  max: ......................................................................... 9976.3
  median: ...................................................................... 9801.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 17:06:00(-0300) (width: 9.994s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 5603
http.request_rate: ............................................................. 623/sec
http.requests: ................................................................. 6210
vusers.created: ................................................................ 6206
vusers.created_by_name.Root (/): ............................................... 6206
vusers.failed: ................................................................. 5603


--------------------------------------
Metrics for period to: 17:06:10(-0300) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 6209
http.request_rate: ............................................................. 560/sec
http.requests: ................................................................. 5609
vusers.created: ................................................................ 5610
vusers.created_by_name.Root (/): ............................................... 5610
vusers.failed: ................................................................. 6209


--------------------------------------
Metrics for period to: 17:06:20(-0300) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 5531
http.codes.200: ................................................................ 77
http.request_rate: ............................................................. 800/sec
http.requests: ................................................................. 7993
http.response_time:
  min: ......................................................................... 8999
  max: ......................................................................... 9971
  median: ...................................................................... 9801.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 77
vusers.completed: .............................................................. 77
vusers.created: ................................................................ 7993
vusers.created_by_name.Root (/): ............................................... 7993
vusers.failed: ................................................................. 5531
vusers.session_length:
  min: ......................................................................... 9016.5
  max: ......................................................................... 10013.1
  median: ...................................................................... 9801.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 17:06:30(-0300) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 6522
http.codes.200: ................................................................ 1654
http.request_rate: ............................................................. 732/sec
http.requests: ................................................................. 7305
http.response_time:
  min: ......................................................................... 7581
  max: ......................................................................... 10008
  median: ...................................................................... 8868.4
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 1654
vusers.completed: .............................................................. 1654
vusers.created: ................................................................ 7305
vusers.created_by_name.Root (/): ............................................... 7305
vusers.failed: ................................................................. 6522
vusers.session_length:
  min: ......................................................................... 7588.4
  max: ......................................................................... 10013.7
  median: ...................................................................... 9416.8
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 17:06:40(-0300) (width: 9.995s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 4853
http.codes.200: ................................................................ 3170
http.request_rate: ............................................................. 690/sec
http.requests: ................................................................. 6879
http.response_time:
  min: ......................................................................... 4518
  max: ......................................................................... 9995
  median: ...................................................................... 7709.8
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 3170
vusers.completed: .............................................................. 3170
vusers.created: ................................................................ 6881
vusers.created_by_name.Root (/): ............................................... 6881
vusers.failed: ................................................................. 4853
vusers.session_length:
  min: ......................................................................... 4538.3
  max: ......................................................................... 10033.1
  median: ...................................................................... 8024.5
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2